import { UpdateData } from './update-data.class';

export const META: UpdateData[] = [
    {
        time: '2019-01-28',
        detail: [
            '由于页面作者工作忙加上过于沙雕',
            '之前都没有记下来更新时间，所以暂时写一起',
            '[ ✔ ] 修复试听音频造成的卡顿',
            '[ ✔ ] 铺面详情增加试听与下载',
            '[ ✔ ] 页面滚动条修改',
            '[ ✔ ] 搜索功能调整',
            '[ ✔ ] 增加页面加载前的动画（智障edge加载慢暂时没办法）',
        ]
    }, {
        time: '2018-12-28',
        detail: [
            '[ ✔ ] 第一个上线版本',
            '[ ✔ ] 功能：可以预览最新map和热门map'
        ]
    }
];
