import { UpdateData } from './update-data.class';

export const META: UpdateData[] = [
    {
        time: '2019-03-26',
        detail: [
            '[ ✔ ] 详情图添加分享按钮，可以分享好听的歌曲给小伙伴啦',
        ]
    },
    {
        time: '2019-03-20',
        detail: [
            '[ ✔ ] 修复模式显示错误',
        ]
    },
    {
        time: '2019-03-16',
        detail: [
            '[ ✔ ] 右上角增加设置按钮',
            '[ ✔ ] 增加线路切换',
        ]
    },
    {
        time: '2019-03-10',
        detail: [
            '[ ✔ ] 丰富预览图功能',
            '[ ✔ ] 预览图列表可以直接播放和下载',
        ]
    },
    {
        time: '2019-02-26',
        detail: [
            '[ ✔ ] 铺面预览低分辨率适配',
        ]
    },
    {
        time: '2019-02-24',
        detail: [
            '[ ✔ ] 修复搜索 TAB 结果重复加载',
            '[ ✔ ] 搜索功能强化，UI调整',
        ]
    },
    {
        time: '2019-01-31',
        detail: [
            '[ ✔ ] 图片的滚动懒加载',
            '[ ✔ ] 投喂支持列表',
        ]
    }, {
        time: '2019-01-28',
        detail: [
            '由于页面作者工作忙加上过于沙雕',
            '之前都没有记下来更新时间，所以暂时写一起',
            '[ ✔ ] 修复试听音频造成的卡顿',
            '[ ✔ ] 铺面详情增加试听与下载',
            '[ ✔ ] 页面滚动条修改',
            '[ ✔ ] 搜索功能调整',
            '[ ✔ ] 增加页面加载前的动画（智障edge加载慢暂时没办法）',
        ]
    }, {
        time: '2018-12-28',
        detail: [
            '[ ✔ ] 第一个上线版本',
            '[ ✔ ] 功能：可以预览最新map和热门map'
        ]
    }
];
